In [25]:
import pandas as pd

In [26]:
fl = '/home/hminaya/Code/visa/data/processed/October 2018 - NIV Issuances by Post and Visa Class.csv'

iv = pd.read_csv(
    fl,
    delimiter=' ', 
    header=None,
    names=['Post', 'VisaClass', 'Quantity']
    )

In [27]:
iv

         Post VisaClass Quantity
0     abidjan        a1        3
1     abidjan        a2       17
2     abidjan        b1        5
3     abidjan     b1/b2      409
4     abidjan        b2       27
...       ...       ...      ...
4348   zagreb        j2        1
4349   zagreb        k1        2
4350   zagreb        l1        5
4351   zagreb        l2        4
4352   zagreb        p1        7

[4353 rows x 3 columns]

In [28]:
iv['VisaType'] = 'NIV'
iv['Year'] = 2018
iv['Month'] = 'October'

In [29]:
iv

         Post VisaClass Quantity VisaType  Year    Month
0     abidjan        a1        3      NIV  2018  October
1     abidjan        a2       17      NIV  2018  October
2     abidjan        b1        5      NIV  2018  October
3     abidjan     b1/b2      409      NIV  2018  October
4     abidjan        b2       27      NIV  2018  October
...       ...       ...      ...      ...   ...      ...
4348   zagreb        j2        1      NIV  2018  October
4349   zagreb        k1        2      NIV  2018  October
4350   zagreb        l1        5      NIV  2018  October
4351   zagreb        l2        4      NIV  2018  October
4352   zagreb        p1        7      NIV  2018  October

[4353 rows x 6 columns]